#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role.test_role is tainted, so must be replaced
-/+ resource "aws_iam_role" "test_role" {
      ~ arn                   = "arn:aws:iam::327110749334:role/IacGhcPipelineResourceManagerRoles/test_role" -> (known after apply)
      ~ create_date           = "2024-03-15T19:08:08Z" -> (known after apply)
      ~ id                    = "test_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
        name                  = "test_role"
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ unique_id             = "AROAUYKKR5SLDCVP7H5YT" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
